# JOB 1

In [2]:
import pandas as pd
import sqlite3

In [3]:
df = pd.read_csv('..\\data\\countries of the world.csv')
print(df.head())

           Country                               Region  Population  \
0     Afghanistan         ASIA (EX. NEAR EAST)             31056997
1         Albania   EASTERN EUROPE                          3581655
2         Algeria   NORTHERN AFRICA                        32930091
3  American Samoa   OCEANIA                                   57794
4         Andorra   WESTERN EUROPE                            71201

   Area (sq. mi.) Pop. Density (per sq. mi.) Coastline (coast/area ratio)  \
0          647500                       48,0                         0,00
1           28748                      124,6                         1,26
2         2381740                       13,8                         0,04
3             199                      290,4                        58,29
4             468                      152,1                         0,00

  Net migration Infant mortality (per 1000 births)  GDP ($ per capita)  \
0         23,06                             163,07               700.0
1         -4,93                              21,52              4500.0
2         -0,39                                 31              6000.0
3        -20,71                               9,27              8000.0
4           6,6                               4,05             19000.0

  Literacy (%) Phones (per 1000) Arable (%) Crops (%) Other (%) Climate  \
0         36,0               3,2      12,13      0,22     87,65       1
1         86,5              71,2      21,09      4,42     74,49       3
2         70,0              78,1       3,22      0,25     96,53       1
3         97,0             259,5         10        15        75       2
4        100,0             497,2       2,22         0     97,78       3

  Birthrate Deathrate Agriculture Industry Service
0      46,6     20,34        0,38     0,24    0,38
1     15,11      5,22       0,232    0,188   0,579
2     17,14      4,61       0,101      0,6   0,298
3     22,46      3,27         NaN      NaN     NaN
4      8,71      6,25         NaN      NaN     NaN

In [4]:
# Clean column names
df.columns = df.columns.str.lower().str.replace(' ', '_').str.replace('(', '').str.replace(')', '').str.replace('.', '').str.replace('$', '').str.replace('%', '')
# Rename columns to match job expectations
rename_dict = {
    'country': 'name',
    'region': 'region',
    'population': 'population',
    'area_sq_mi': 'area',
    'pop_density_per_sq_mi': 'density',
    'coastline_coast/area_ratio': 'coastline',
    'net_migration': 'net_migration',
    'infant_mortality_per_1000_births': 'infant_mortality',
    'gdp__per_capita': 'gdp_per_capita',
    'literacy_': 'literacy',
    'phones_per_1000': 'phones',
    'arable_': 'arable',
    'crops_': 'crops',
    'other_': 'other',
    'climate': 'climate',
    'birthrate': 'birthrate',
    'deathrate': 'deathrate',
    'agriculture': 'agriculture',
    'industry': 'industry',
    'service': 'service'
}
df = df.rename(columns=rename_dict)

# Ce code parcourt toutes les colonnes de type « object » (chaînes) et, pour chacune, applique str.strip() : il supprime les espaces (et tabulations/retours) au début et à la fin de chaque valeur texte.
for col in df.select_dtypes(include=['object']).columns:
    df[col] = df[col].str.strip()

# Convert numeric columns (replace ',' with '.' and convert to float)
numeric_cols = ['population', 'area', 'density', 'coastline', 'net_migration', 'infant_mortality', 'gdp_per_capita', 'literacy', 'phones', 'arable', 'crops', 'other', 'birthrate', 'deathrate', 'agriculture', 'industry', 'service']
for col in numeric_cols:
    if col in df.columns:
        df[col] = pd.to_numeric(df[col].astype(str).str.replace(',', '.'), errors='coerce')

In [5]:
# Create an in-memory SQLite database
conn = sqlite3.connect(':memory:')

# Insert the DataFrame into the database as a table named 'world'
df.to_sql('world', conn, index=False, if_exists='replace')


# Query the 'world' table
result = pd.read_sql('SELECT * FROM world LIMIT 5', conn)
print(result)

             name                region  population     area  density  \
0     Afghanistan  ASIA (EX. NEAR EAST)    31056997   647500     48.0
1         Albania        EASTERN EUROPE     3581655    28748    124.6
2         Algeria       NORTHERN AFRICA    32930091  2381740     13.8
3  American Samoa               OCEANIA       57794      199    290.4
4         Andorra        WESTERN EUROPE       71201      468    152.1

   coastline  net_migration  infant_mortality  gdp_per_capita  literacy  \
0       0.00          23.06            163.07           700.0      36.0
1       1.26          -4.93             21.52          4500.0      86.5
2       0.04          -0.39             31.00          6000.0      70.0
3      58.29         -20.71              9.27          8000.0      97.0
4       0.00           6.60              4.05         19000.0     100.0

   phones  arable  crops  other climate  birthrate  deathrate  agriculture  \
0     3.2   12.13   0.22  87.65       1      46.60      20.34        0.380
1    71.2   21.09   4.42  74.49       3      15.11       5.22        0.232
2    78.1    3.22   0.25  96.53       1      17.14       4.61        0.101
3   259.5   10.00  15.00  75.00       2      22.46       3.27          NaN
4   497.2    2.22   0.00  97.78       3       8.71       6.25          NaN

   industry  service
0     0.240    0.380
1     0.188    0.579
2     0.600    0.298
3       NaN      NaN
4       NaN      NaN

In [6]:
print("test population de la france :")
test = pd.read_sql("SELECT name, population FROM world WHERE name = 'France'", conn)
print(test)

test population de la france :
     name  population
0  France    60876136

In [7]:
print("2")
result = pd.read_sql("SELECT name, population FROM  world where name IN ('Sweden', 'Norway', 'Denmark')", conn)
print(result)

2
      name  population
0  Denmark     5450661
1   Norway     4610820
2   Sweden     9016596

In [8]:
print("3: pays dont la superficie est superieure a 200000 mais inferieure a 300000")
result = pd.read_sql("SELECT name, area From world WHERE area >200000 AND area <300000",conn )
print(result)

3: pays dont la superficie est superieure a 200000 mais inferieure a 300000
              name    area
0          Belarus  207600
1     Burkina Faso  274200
2          Ecuador  283560
3            Gabon  267667
4            Ghana  239460
5           Guinea  245857
6           Guyana  214970
7             Laos  236800
8      New Zealand  268680
9             Oman  212460
10         Romania  237500
11          Uganda  236040
12  United Kingdom  244820
13  Western Sahara  266000

# Job 2

In [9]:
print("Job_2: 1/ Noms des pays dont le nom commence par la lettre 'B'")
result = pd.read_sql("SELECT name FROM world where name LIKE 'B%'", conn)
print(result)

Job_2: 1/ Noms des pays dont le nom commence par la lettre 'B'
                    name
0           Bahamas, The
1                Bahrain
2             Bangladesh
3               Barbados
4                Belarus
5                Belgium
6                 Belize
7                  Benin
8                Bermuda
9                 Bhutan
10               Bolivia
11  Bosnia & Herzegovina
12              Botswana
13                Brazil
14    British Virgin Is.
15                Brunei
16              Bulgaria
17          Burkina Faso
18                 Burma
19               Burundi

In [10]:
print("2: c`ountries with the name ending with 'y'")
result = pd.read_sql("SELECT name FROM world where name LIKE  'Al%'", conn)
print(result)

2: c`ountries with the name ending with 'y'
      name
0  Albania
1  Algeria

In [11]:
print("3: coutries with the name ending with 'y'")
result = pd.read_sql("SELECT name FROM world where name LIKE '%y'", conn)
print(result)

3: coutries with the name ending with 'y'
       name
0   Germany
1  Guernsey
2   Hungary
3     Italy
4    Jersey
5    Norway
6  Paraguay
7    Turkey
8   Uruguay

In [12]:
print("4: Countries with the name ending with 'land'")
result = pd.read_sql("SELECT name FROM world where name LIKE '%land'", conn)
print(result)

4: Countries with the name ending with 'land'
          name
0      Finland
1    Greenland
2      Iceland
3      Ireland
4  New Zealand
5       Poland
6    Swaziland
7  Switzerland
8     Thailand

In [13]:
print("5: coutries with the name have a w like letter")
result = pd.read_sql("SELECT name FROM world where name LIKE '%w%'", conn)
print(result)

5: coutries with the name have a w like letter
                 name
0            Botswana
1              Kuwait
2              Malawi
3       New Caledonia
4         New Zealand
5              Norway
6    Papua New Guinea
7              Rwanda
8           Swaziland
9              Sweden
10        Switzerland
11             Taiwan
12  Wallis and Futuna
13          West Bank
14     Western Sahara
15           Zimbabwe

In [14]:
print("6: countries with the name having 'oo' or 'ee' ")
result = pd.read_sql("SELECT name FROM world where name LIKE '%oo%' OR name LIKE '%ee'", conn)
print(result)

6: countries with the name having 'oo' or 'ee'
           name
0      Cameroon
1  Cook Islands

In [15]:
print(" 7: countries with at least three 'a' in the name")
query = """
SELECT name
FROM world
WHERE LOWER(name) LIKE '%a%a%a%'
ORDER BY name;
"""
result = pd.read_sql(query, conn)
print(result)

 7: countries with at least three 'a' in the name
                                name
0                        Afghanistan
1                            Albania
2                     American Samoa
3                  Antigua & Barbuda
4                          Australia
5                         Azerbaijan
6                       Bahamas, The
7                             Canada
8                     Cayman Islands
9               Central African Rep.
10                 Equatorial Guinea
11                         Guatemala
12                           Jamaica
13                        Kazakhstan
14                        Madagascar
15                          Malaysia
16                  Marshall Islands
17                        Mauritania
18                N. Mariana Islands
19                         Nicaragua
20                            Panama
21                  Papua New Guinea
22                          Paraguay
23  Saint Vincent and the Grenadines
24                      Saudi Arabia
25                          Tanzania
26              United Arab Emirates
27                 Wallis and Futuna
28                    Western Sahara

In [16]:
print("8: the countries where the second letter of the name is r")
result = pd.read_sql("SELECT name FROM world WHERE name LIKE '_r%'", conn)
print(result)

8: the countries where the second letter of the name is r
                  name
0            Argentina
1              Armenia
2                Aruba
3               Brazil
4   British Virgin Is.
5               Brunei
6              Croatia
7              Eritrea
8               France
9        French Guiana
10    French Polynesia
11              Greece
12           Greenland
13             Grenada
14                Iran
15                Iraq
16             Ireland
17           Sri Lanka
18   Trinidad & Tobago
19             Uruguay

# Job 3

In [17]:
students_df = pd.DataFrame([
    (1, 'Alice',   'Johnson', 22, 'A+'),
    (2, 'Bob',     'Smith',   20, 'B'),
    (3, 'Charlie', 'Williams',21, 'C'),
    (4, 'David',   'Brown',   23, 'B+'),
    (5, 'Eva',     'Davis',   19, 'A'),
    (6, 'Frank',   'Jones',   22, 'C+'),
], columns=['student_id', 'first_name', 'last_name', 'age', 'grade'])

# Base sql en memoire 
conn_students = sqlite3.connect(':memory:')

#creer la table students + insere les donnees
students_df.to_sql('student', conn_students, index=False, if_exists='replace')

#verifier que les donnees sont bien inserees
result_students = pd.read_sql('SELECT * FROM student LIMIT 5', conn_students)
print(result_students)

   student_id first_name last_name  age grade
0           1      Alice   Johnson   22    A+
1           2        Bob     Smith   20     B
2           3    Charlie  Williams   21     C
3           4      David     Brown   23    B+
4           5        Eva     Davis   19     A

In [18]:
print("1: all columns of the table students")
result = pd.read_sql("SELECT * FROM student", conn_students)
print(result)

1: all columns of the table students
   student_id first_name last_name  age grade
0           1      Alice   Johnson   22    A+
1           2        Bob     Smith   20     B
2           3    Charlie  Williams   21     C
3           4      David     Brown   23    B+
4           5        Eva     Davis   19     A
5           6      Frank     Jones   22    C+

In [19]:
print("2: students with age > 20")
result = pd.read_sql("SELECT first_name, last_name, age FROM student WHERE age > 20", conn_students)
print(result)

2: students with age > 20
  first_name last_name  age
0      Alice   Johnson   22
1    Charlie  Williams   21
2      David     Brown   23
3      Frank     Jones   22

In [20]:
print("3: faire un classement des élèves selon leur note dans un ordre croissant, puis dans un ordre décroissant. ")
result = pd.read_sql("SELECT first_name, last_name, grade FROM student ORDER BY grade ASC", conn_students)
print("Ordre croissant:")
print(result)
result_desc = pd.read_sql("SELECT first_name, last_name, grade FROM student ORDER BY grade DESC", conn_students)
print("Ordre décroissant:")
print(result_desc)

3: faire un classement des élèves selon leur note dans un ordre croissant, puis dans un ordre décroissant.
Ordre croissant:
  first_name last_name grade
0        Eva     Davis     A
1      Alice   Johnson    A+
2        Bob     Smith     B
3      David     Brown    B+
4    Charlie  Williams     C
5      Frank     Jones    C+
Ordre décroissant:
  first_name last_name grade
0      Frank     Jones    C+
1    Charlie  Williams     C
2      David     Brown    B+
3        Bob     Smith     B
4      Alice   Johnson    A+
5        Eva     Davis     A

# Job 4

In [21]:

nobel_df = pd.DataFrame([
    ('1960', 'Chemistry', 'Willard F. Libby'),
    ('1960', 'Literature', 'Saint-John Perse'),
    ('1960', 'Medicine', 'Sir Frank Macfarlane Burnet'),
    ('1960', 'Medicine', 'Peter Medawar'),
    ],
    columns=['year', 'subject', 'winner'])

In [22]:
# base sql en memoire
conn_nobel = sqlite3.connect(':memory:')

nobel_df.to_sql('nobel', conn_nobel, index=False, if_exists='replace')
print(pd.read_sql("SELECT * FROM nobel", conn_nobel))

   year     subject                       winner
0  1960   Chemistry             Willard F. Libby
1  1960  Literature             Saint-John Perse
2  1960    Medicine  Sir Frank Macfarlane Burnet
3  1960    Medicine                Peter Medawar

In [23]:
print("1: price winners in 1986")
result = pd.read_sql("SELECT winner FROM nobel WHERE year = '1986'", conn_nobel)
print(result)

1: price winners in 1986
Empty DataFrame
Columns: [winner]
Index: []

In [24]:
print("price winners in Literature in 1986")
result = pd.read_sql("SELECT winner FROM nobel WHERE year = '1967' AND subject = 'Literature'", conn_nobel)
print(result)

price winners in Literature in 1986
Empty DataFrame
Columns: [winner]
Index: []

In [25]:
print(" 3: print the year and subject of nobel prize for Albert Einstein")
result = pd.read_sql("SELECT year, subject FROM nobel WHERE winner = 'Albert Einstein'", conn_nobel)
print(result)

 3: print the year and subject of nobel prize for Albert Einstein
Empty DataFrame
Columns: [year, subject]
Index: []

In [26]:
print("4:print all the information for nobel prize in 1980 - 1989")
result = pd.read_sql("SELECT * FROM nobel WHERE year BETWEEN 1980 AND 1989", conn_nobel)
print(result)

4:print all the information for nobel prize in 1980 - 1989
Empty DataFrame
Columns: [year, subject, winner]
Index: []

In [27]:
print("5: print all the information for nobel prize in Mathematics")
result = pd.read_sql("SELECT * FROM nobel WHERE subject = 'Mathematics'", conn_nobel)
print(result)

5: print all the information for nobel prize in Mathematics
Empty DataFrame
Columns: [year, subject, winner]
Index: []

# JOB 5

In [28]:
print("1: Display the countries with the population > population of Russia")
result = pd.read_sql("SELECT name, population FROM world WHERE population > (SELECT population FROM world WHERE name = 'Russia') ", conn)
print(result)

1: Display the countries with the population > population of Russia
            name  population
0     Bangladesh   147365352
1         Brazil   188078227
2          China  1313973713
3          India  1095351995
4      Indonesia   245452739
5       Pakistan   165803560
6  United States   298444215

In [29]:
print("2: Display the European countries with PIB per habitant > Italy") 
result = pd.read_sql("SELECT name, gdp_per_capita FROM world WHERE region in ('WESTERN EUROPE', 'EASTERN EUROPE') AND gdp_per_capita > (SELECT gdp_per_capita FROM world WHERE name = 'Italy')", conn)
print(result)

2: Display the European countries with PIB per habitant > Italy
              name  gdp_per_capita
0          Austria         30000.0
1          Belgium         29100.0
2          Denmark         31100.0
3          Finland         27400.0
4           France         27600.0
5          Germany         27600.0
6          Iceland         30900.0
7          Ireland         29600.0
8       Luxembourg         55100.0
9           Monaco         27000.0
10     Netherlands         28600.0
11          Norway         37800.0
12      San Marino         34600.0
13          Sweden         26800.0
14     Switzerland         32700.0
15  United Kingdom         27700.0

In [30]:
print("3: Display the coutries with the population between > popularion royaume unie < Allemagne")
result = pd.read_sql("SELECT name, population FROM world WHERE population BETWEEN (SELECT population From world WHERE name = 'United Kingdom') AND (SELECT population FROM world WHERE name = 'Germany')", conn)
print(result)

3: Display the coutries with the population between > popularion royaume unie < Allemagne
               name  population
0  Congo, Dem. Rep.    62660551
1             Egypt    78887007
2          Ethiopia    74777981
3            France    60876136
4           Germany    82422299
5              Iran    68688433
6          Thailand    64631595
7            Turkey    70413958
8    United Kingdom    60609153

In [31]:
print("4: une requête permettant d’afficher le nomet la population de chaque pays d'Europe, en pourcentage de la population de l'Allemagne.")
query = """
SELECT 
    name, 
    population,
    ROUND((population * 100.0 / (SELECT population FROM world WHERE name = 'Germany')), 2) as pct_vs_germany
FROM 
    world
WHERE 
    region LIKE '%Europe%'  -- On utilise LIKE car la colonne contient souvent 'Western Europe', etc.
ORDER BY 
    pct_vs_germany DESC;
"""
result = pd.read_sql(query, conn)
print(result)

4: une requête permettant d’afficher le nomet la population de chaque pays d'Europe, en pourcentage de la population de l'Allemagne.
                    name  population  pct_vs_germany
0                Germany    82422299          100.00
1                 France    60876136           73.86
2         United Kingdom    60609153           73.53
3                  Italy    58133509           70.53
4                  Spain    40397842           49.01
5                 Poland    38536869           46.76
6                Romania    22303552           27.06
7            Netherlands    16491461           20.01
8                 Greece    10688058           12.97
9               Portugal    10605870           12.87
10               Belgium    10379067           12.59
11        Czech Republic    10235455           12.42
12               Hungary     9981334           12.11
13                Serbia     9396411           11.40
14                Sweden     9016596           10.94
15               Austria     8192880            9.94
16           Switzerland     7523934            9.13
17              Bulgaria     7385367            8.96
18               Denmark     5450661            6.61
19              Slovakia     5439448            6.60
20               Finland     5231372            6.35
21                Norway     4610820            5.59
22  Bosnia & Herzegovina     4498976            5.46
23               Croatia     4494749            5.45
24               Ireland     4062235            4.93
25               Albania     3581655            4.35
26             Macedonia     2050554            2.49
27              Slovenia     2010347            2.44
28            Luxembourg      474413            0.58
29                 Malta      400214            0.49
30               Iceland      299388            0.36
31                Jersey       91084            0.11
32               Andorra       71201            0.09
33           Isle of Man       75441            0.09
34              Guernsey       65409            0.08
35         Faroe Islands       47246            0.06
36         Liechtenstein       33987            0.04
37                Monaco       32543            0.04
38            San Marino       29251            0.04
39             Gibraltar       27928            0.03

In [32]:
print("""5: une requête permettant de trouver le plus grand pays de
chaque continent, en indiquant son continent, son nom et sa
superficie.""")
result = pd.read_sql("SELECT region AS continent, name, area FROM (SELECT region, name, area, ROW_NUMBER() OVER (PARTITION BY region ORDER BY area DESC) AS rn FROM world) t WHERE rn = 1;", conn)
print(result)

5: une requête permettant de trouver le plus grand pays de
chaque continent, en indiquant son continent, son nom et sa
superficie.
               continent          name      area
0   ASIA (EX. NEAR EAST)         China   9596960
1                BALTICS     Lithuania     65200
2    C.W. OF IND. STATES        Russia  17075200
3         EASTERN EUROPE        Poland    312685
4    LATIN AMER. & CARIB        Brazil   8511965
5              NEAR EAST  Saudi Arabia   1960582
6        NORTHERN AFRICA       Algeria   2381740
7       NORTHERN AMERICA        Canada   9984670
8                OCEANIA     Australia   7686850
9     SUB-SAHARAN AFRICA         Sudan   2505810
10        WESTERN EUROPE        France    547030

In [33]:
print("""6: une requête permettant de trouver les continents où tous les
pays ont une population inférieure ou égale à 25 000 000. """)
result = pd.read_sql (" SELECT region, population FROM world GROUP BY region HAVING MAX(population) <= 25000000", conn)
print(result)

6: une requête permettant de trouver les continents où tous les
pays ont une population inférieure ou égale à 25 000 000.
    region  population
0  BALTICS     3585906
1  OCEANIA    20264082

# JOB 6

In [34]:
print("1: Créez une requête permettant d’afficher la population totale du monde.")
result =  pd.read_sql("SELECT SUM(population) AS total_population FROM world", conn)
print(result)

Créez une requête permettant d’afficher la population totale du monde.
   total_population
0        6524044551

In [35]:
print("2: une requête permettant d’afficher la population totale de chacun des continents")
result = pd.read_sql("SELECT region AS continent, SUM(population) AS total_population FROM world GROUP BY region", conn)
print(result)

une requête permettant d’afficher la population totale de chacun des continents
               continent  total_population
0   ASIA (EX. NEAR EAST)        3687982236
1                BALTICS           7184974
2    C.W. OF IND. STATES         280081548
3         EASTERN EUROPE         119914717
4    LATIN AMER. & CARIB         561824599
5              NEAR EAST         195068377
6        NORTHERN AFRICA         161407133
7       NORTHERN AMERICA         331672307
8                OCEANIA          33131662
9     SUB-SAHARAN AFRICA         749437000
10        WESTERN EUROPE         396339998

In [36]:
print("3: une requête permettant d’afficher le PIB total du continent de chacun des continents.")
result = pd.read_sql("SELECT region AS continent, SUM(gdp_per_capita * population) AS total_gdp FROM world GROUP BY region", conn)
print(result)

3: une requête permettant d’afficher le PIB total du continent de chacun des continents.
               continent     total_gdp
0   ASIA (EX. NEAR EAST)  1.858503e+13
1                BALTICS  8.037092e+10
2    C.W. OF IND. STATES  1.831262e+12
3         EASTERN EUROPE  1.175608e+12
4    LATIN AMER. & CARIB  4.086194e+12
5              NEAR EAST  1.275718e+12
6        NORTHERN AFRICA  7.540660e+11
7       NORTHERN AMERICA  1.227108e+13
8                OCEANIA  7.102268e+11
9     SUB-SAHARAN AFRICA  1.293160e+12
10        WESTERN EUROPE  1.064728e+13

In [37]:
print("4: une requête permettant d’afficher le PIB total du continent africain.")
result = pd.read_sql("SELECT SUM(gdp_per_capita * population) AS total_gdp_africa FROM world WHERE region = 'SUB-SAHARAN AFRICA'", conn)
print(result)

4: une requête permettant d’afficher le PIB total du continent africain.
   total_gdp_africa
0      1.293160e+12

In [38]:
print("5: Créez une requête permettant d’afficher le nombre de pays ayant une superficie supérieure ou égale à 1 000 000m2.")
result = pd.read_sql("SELECT COUNT(name) AS num_countries_large_area FROM world WHERE area >= 1000000", conn)
print(result)

Créez une requête permettant d’afficher le nombre de pays ayant une superficie supérieure ou égale à 1 000 000m2.
   num_countries_large_area
0                        30

In [39]:
print("6:Créez une requête permettant d’afficher la population totale des pays suivants : Estonia, Latvia, Lithuania. ")
result = pd.read_sql("SELECT SUM(population) AS total_population_baltic FROM world WHERE name IN ('Estonia', 'Latvia', 'Lithuania')", conn)
print(result)

6:Créez une requête permettant d’afficher la population totale des pays suivants : Estonia, Latvia, Lithuania.
   total_population_baltic
0                  7184974

In [40]:
print("7: Une requete permettant d'afficher le nombre de pays par continent ")
result = pd.read_sql("SELECT region AS continent, COUNT(name) AS num_countries FROM world GROUP BY region", conn)
print(result)

7: Une requete permettant d'afficher le nombre de pays par continent
               continent  num_countries
0   ASIA (EX. NEAR EAST)             28
1                BALTICS              3
2    C.W. OF IND. STATES             12
3         EASTERN EUROPE             12
4    LATIN AMER. & CARIB             45
5              NEAR EAST             16
6        NORTHERN AFRICA              6
7       NORTHERN AMERICA              5
8                OCEANIA             21
9     SUB-SAHARAN AFRICA             51
10        WESTERN EUROPE             28

In [41]:
print("8: Une requete permettant d'afficher les continents  ayant une population totale supérieure à 100 millions d'habitants ")
result = pd.read_sql("SELECT region AS continent, SUM(population) AS total_population FROM world GROUP BY region HAVING total_population > 100000000", conn)
print(result)

8: Une requete permettant d'afficher les continents  ayant une population totale supérieure à 100 millions d'habitants
              continent  total_population
0  ASIA (EX. NEAR EAST)        3687982236
1   C.W. OF IND. STATES         280081548
2        EASTERN EUROPE         119914717
3   LATIN AMER. & CARIB         561824599
4             NEAR EAST         195068377
5       NORTHERN AFRICA         161407133
6      NORTHERN AMERICA         331672307
7    SUB-SAHARAN AFRICA         749437000
8        WESTERN EUROPE         396339998

# JOB 7